jharoian-mchp/24013_DEV3/firmware/pic32cz_ca90/03_SWODemo/src/packs/PIC32CZ2051CA90208_DFP/component/supc.h
/*
 * Component description for SUPC
 *
 * Copyright (c) 2024 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2024-07-31T17:51:00Z */
#ifndef _PIC32CZCA90_SUPC_COMPONENT_H_
#define _PIC32CZCA90_SUPC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR SUPC                                         */
/* ************************************************************************** */

/* -------- SUPC_INTENCLR : (SUPC Offset: 0x00) (R/W 32) Interrupt Enable Clear -------- */
#define SUPC_INTENCLR_RESETVALUE              _UINT32_(0x00)                                       /*  (SUPC_INTENCLR) Interrupt Enable Clear  Reset Value */

#define SUPC_INTENCLR_LVDET_Pos               _UINT32_(0)                                          /* (SUPC_INTENCLR) Low Voltage Detector Interrupt Enable Position */
#define SUPC_INTENCLR_LVDET_Msk               (_UINT32_(0x1) << SUPC_INTENCLR_LVDET_Pos)           /* (SUPC_INTENCLR) Low Voltage Detector Interrupt Enable Mask */
#define SUPC_INTENCLR_LVDET(value)            (SUPC_INTENCLR_LVDET_Msk & (_UINT32_(value) << SUPC_INTENCLR_LVDET_Pos)) /* Assigment of value for LVDET in the SUPC_INTENCLR register */
#define SUPC_INTENCLR_LVDRDY_Pos              _UINT32_(1)                                          /* (SUPC_INTENCLR) Low Voltage Detector Ready Interrupt Enable Position */
#define SUPC_INTENCLR_LVDRDY_Msk              (_UINT32_(0x1) << SUPC_INTENCLR_LVDRDY_Pos)          /* (SUPC_INTENCLR) Low Voltage Detector Ready Interrupt Enable Mask */
#define SUPC_INTENCLR_LVDRDY(value)           (SUPC_INTENCLR_LVDRDY_Msk & (_UINT32_(value) << SUPC_INTENCLR_LVDRDY_Pos)) /* Assigment of value for LVDRDY in the SUPC_INTENCLR register */
#define SUPC_INTENCLR_BORVDDUSB_Pos           _UINT32_(5)                                          /* (SUPC_INTENCLR) BORVDDUSB Interrupt Enable Position */
#define SUPC_INTENCLR_BORVDDUSB_Msk           (_UINT32_(0x3) << SUPC_INTENCLR_BORVDDUSB_Pos)       /* (SUPC_INTENCLR) BORVDDUSB Interrupt Enable Mask */
#define SUPC_INTENCLR_BORVDDUSB(value)        (SUPC_INTENCLR_BORVDDUSB_Msk & (_UINT32_(value) << SUPC_INTENCLR_BORVDDUSB_Pos)) /* Assigment of value for BORVDDUSB in the SUPC_INTENCLR register */
#define SUPC_INTENCLR_ADDVREGRDY0_Pos         _UINT32_(8)                                          /* (SUPC_INTENCLR) Additional Regulator ready 0 Interrupt Enable Position */
#define SUPC_INTENCLR_ADDVREGRDY0_Msk         (_UINT32_(0x1) << SUPC_INTENCLR_ADDVREGRDY0_Pos)     /* (SUPC_INTENCLR) Additional Regulator ready 0 Interrupt Enable Mask */
#define SUPC_INTENCLR_ADDVREGRDY0(value)      (SUPC_INTENCLR_ADDVREGRDY0_Msk & (_UINT32_(value) << SUPC_INTENCLR_ADDVREGRDY0_Pos)) /* Assigment of value for ADDVREGRDY0 in the SUPC_INTENCLR register */
#define SUPC_INTENCLR_ADDVREGRDY1_Pos         _UINT32_(9)                                          /* (SUPC_INTENCLR) Additional Regulator ready 1 Interrupt Enable Position */
#define SUPC_INTENCLR_ADDVREGRDY1_Msk         (_UINT32_(0x1) << SUPC_INTENCLR_ADDVREGRDY1_Pos)     /* (SUPC_INTENCLR) Additional Regulator ready 1 Interrupt Enable Mask */
#define SUPC_INTENCLR_ADDVREGRDY1(value)      (SUPC_INTENCLR_ADDVREGRDY1_Msk & (_UINT32_(value) << SUPC_INTENCLR_ADDVREGRDY1_Pos)) /* Assigment of value for ADDVREGRDY1 in the SUPC_INTENCLR register */
#define SUPC_INTENCLR_ADDVREGRDY2_Pos         _UINT32_(10)                                         /* (SUPC_INTENCLR) Additional Regulator ready 2 Interrupt Enable Position */
#define SUPC_INTENCLR_ADDVREGRDY2_Msk         (_UINT32_(0x1) << SUPC_INTENCLR_ADDVREGRDY2_Pos)     /* (SUPC_INTENCLR) Additional Regulator ready 2 Interrupt Enable Mask */
#define SUPC_INTENCLR_ADDVREGRDY2(value)      (SUPC_INTENCLR_ADDVREGRDY2_Msk & (_UINT32_(value) << SUPC_INTENCLR_ADDVREGRDY2_Pos)) /* Assigment of value for ADDVREGRDY2 in the SUPC_INTENCLR register */
#define SUPC_INTENCLR_Msk                     _UINT32_(0x00000763)                                 /* (SUPC_INTENCLR) Register Mask  */

#define SUPC_INTENCLR_ADDVREGRDY_Pos          _UINT32_(8)                                          /* (SUPC_INTENCLR Position) Additional Regulator ready 2 Interrupt Enable */
#define SUPC_INTENCLR_ADDVREGRDY_Msk          (_UINT32_(0x7) << SUPC_INTENCLR_ADDVREGRDY_Pos)      /* (SUPC_INTENCLR Mask) ADDVREGRDY */
#define SUPC_INTENCLR_ADDVREGRDY(value)       (SUPC_INTENCLR_ADDVREGRDY_Msk & (_UINT32_(value) << SUPC_INTENCLR_ADDVREGRDY_Pos)) 

/* -------- SUPC_INTENSET : (SUPC Offset: 0x04) (R/W 32) Interrupt Enable Set -------- */
#define SUPC_INTENSET_RESETVALUE              _UINT32_(0x00)                                       /*  (SUPC_INTENSET) Interrupt Enable Set  Reset Value */

#define SUPC_INTENSET_LVDET_Pos               _UINT32_(0)                                          /* (SUPC_INTENSET) Low Voltage Detector Interrupt Enable Position */
#define SUPC_INTENSET_LVDET_Msk               (_UINT32_(0x1) << SUPC_INTENSET_LVDET_Pos)           /* (SUPC_INTENSET) Low Voltage Detector Interrupt Enable Mask */
#define SUPC_INTENSET_LVDET(value)            (SUPC_INTENSET_LVDET_Msk & (_UINT32_(value) << SUPC_INTENSET_LVDET_Pos)) /* Assigment of value for LVDET in the SUPC_INTENSET register */
#define SUPC_INTENSET_LVDRDY_Pos              _UINT32_(1)                                          /* (SUPC_INTENSET) Low Voltage Detector Ready Interrupt Enable Position */
#define SUPC_INTENSET_LVDRDY_Msk              (_UINT32_(0x1) << SUPC_INTENSET_LVDRDY_Pos)          /* (SUPC_INTENSET) Low Voltage Detector Ready Interrupt Enable Mask */
#define SUPC_INTENSET_LVDRDY(value)           (SUPC_INTENSET_LVDRDY_Msk & (_UINT32_(value) << SUPC_INTENSET_LVDRDY_Pos)) /* Assigment of value for LVDRDY in the SUPC_INTENSET register */
#define SUPC_INTENSET_BORVDDUSB_Pos           _UINT32_(5)                                          /* (SUPC_INTENSET) BORVDDUSB Interrupt Enable Position */
#define SUPC_INTENSET_BORVDDUSB_Msk           (_UINT32_(0x3) << SUPC_INTENSET_BORVDDUSB_Pos)       /* (SUPC_INTENSET) BORVDDUSB Interrupt Enable Mask */
#define SUPC_INTENSET_BORVDDUSB(value)        (SUPC_INTENSET_BORVDDUSB_Msk & (_UINT32_(value) << SUPC_INTENSET_BORVDDUSB_Pos)) /* Assigment of value for BORVDDUSB in the SUPC_INTENSET register */
#define SUPC_INTENSET_ADDVREGRDY0_Pos         _UINT32_(8)                                          /* (SUPC_INTENSET) Additional Regulator ready 0 Interrupt Enable Position */
#define SUPC_INTENSET_ADDVREGRDY0_Msk         (_UINT32_(0x1) << SUPC_INTENSET_ADDVREGRDY0_Pos)     /* (SUPC_INTENSET) Additional Regulator ready 0 Interrupt Enable Mask */
#define SUPC_INTENSET_ADDVREGRDY0(value)      (SUPC_INTENSET_ADDVREGRDY0_Msk & (_UINT32_(value) << SUPC_INTENSET_ADDVREGRDY0_Pos)) /* Assigment of value for ADDVREGRDY0 in the SUPC_INTENSET register */
#define SUPC_INTENSET_ADDVREGRDY1_Pos         _UINT32_(9)                                          /* (SUPC_INTENSET) Additional Regulator ready 1 Interrupt Enable Position */
#define SUPC_INTENSET_ADDVREGRDY1_Msk         (_UINT32_(0x1) << SUPC_INTENSET_ADDVREGRDY1_Pos)     /* (SUPC_INTENSET) Additional Regulator ready 1 Interrupt Enable Mask */
#define SUPC_INTENSET_ADDVREGRDY1(value)      (SUPC_INTENSET_ADDVREGRDY1_Msk & (_UINT32_(value) << SUPC_INTENSET_ADDVREGRDY1_Pos)) /* Assigment of value for ADDVREGRDY1 in the SUPC_INTENSET register */
#define SUPC_INTENSET_ADDVREGRDY2_Pos         _UINT32_(10)                                         /* (SUPC_INTENSET) Additional Regulator ready 2 Interrupt Enable Position */
#define SUPC_INTENSET_ADDVREGRDY2_Msk         (_UINT32_(0x1) << SUPC_INTENSET_ADDVREGRDY2_Pos)     /* (SUPC_INTENSET) Additional Regulator ready 2 Interrupt Enable Mask */
#define SUPC_INTENSET_ADDVREGRDY2(value)      (SUPC_INTENSET_ADDVREGRDY2_Msk & (_UINT32_(value) << SUPC_INTENSET_ADDVREGRDY2_Pos)) /* Assigment of value for ADDVREGRDY2 in the SUPC_INTENSET register */
#define SUPC_INTENSET_Msk                     _UINT32_(0x00000763)                                 /* (SUPC_INTENSET) Register Mask  */

